In [40]:
import pandas as pd
import re
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

url='https://en.wikipedia.org/wiki/List_of_highest-grossing_animated_films'

tables=pd.read_html(url)
movies_df=tables[4]
movies_df.head()

,0,1,2,3,4
0,Year,Title,Worldwide gross,Budget,Ref(s)
1,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423",[# 125][# 170][# 171]
2,1938,NaN,NaN,NaN,NaN
3,1939,Gulliver's Travels,"$3,200,000*","$700,000",[# 172][# 173]
4,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000",[# 158][# 171][# 174]

In [41]:
movies_df.columns=['Year','Title','Worldwide gross','Budget','Ref(s)']

movies_df.drop(movies_df.index[0],inplace=True)
movies_df.head()

,Year,Title,Worldwide gross,Budget,Ref(s)
1,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423",[# 125][# 170][# 171]
2,1938,NaN,NaN,NaN,NaN
3,1939,Gulliver's Travels,"$3,200,000*","$700,000",[# 172][# 173]
4,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000",[# 158][# 171][# 174]
5,1941,Dumbo,"$1,600,000*","$950,000",[# 175][# 176]

In [42]:
movies_df['Worldwide gross'].head(10)

movies_df = movies_df.dropna(subset=['Title'])
movies_df.head()

movies_df.drop(movies_df.loc[movies_df['Title']=='TBD'].index,inplace=True)
movies_df=movies_df.reset_index(drop=True)
movies_df.head()
movies_df=movies_df.drop(['Ref(s)'],axis=1)
movies_df=movies_df.rename(columns={'Distributor Rental':'Total Sales'})
movies_df.to_csv('Movies_New.csv')

movies_df.head()

C:\Users\rohin\Anaconda3\lib\site-packages\pandas\core\frame.py:3697: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

,Year,Title,Worldwide gross,Budget
0,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423"
1,1939,Gulliver's Travels,"$3,200,000*","$700,000"
2,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000"
3,1941,Dumbo,"$1,600,000*","$950,000"
4,1942,Bambi,"$267,447,150 ($3,449,353)R","$1,700,000–2,000,000"

In [43]:

l=movies_df['Worldwide gross'].str.slice()
#re.sub("\D", "",(movies_df['Worldwide gross'].str.split()))
l

0                $418,200,000+ ($8,500,000)R
1                                $3,200,000*
2                 $87,000,862* ($3,500,000)R
3                                $1,600,000*
4                 $267,447,150 ($3,449,353)R
5                                  $799,000*
6                                $3,355,000R
7                  ES€5,595,283ES (~$90,000)
8                                $3,275,000R
9                                $3,165,000R
10                               $2,560,000R
11                               $1,625,000R
12    $263,591,415($20,000,000/$7,800,000)*R
13                               $2,400,000*
14                 $145,000,000 ($7,000,000)
15               $187,000,000 ($6,500,000)*R
16                $51,600,000* ($5,300,000)R
17                              $215,880,212
18             $22,182,353*R ($13,050,777)*R
19       $1,940,903*–2,438,233*($1,130,000)R
20                               $2,764,684*
21                $378,000,000($23,800,000)R
22               SEK1,270,971SW (~$245,000)H
23                              $12,000,000*
24               $191,000,000 ($26,462,000)R
25               SEK1,202,319 SW (~$253,000)
26                               $90,000,000
27               $32,056,467* ($17,160,000)R
28          SEK5,813,000SW (~$2,675,205.50)H
29                           $6,439,069NW SW
                       ...
44                               $47,431,461
45               $424,967,620 ($351,863,363)
46                              $504,050,219
47                $81,877,069 ($50,003,043)*
48               $968,483,777 ($766,964,132)
49               $373,554,033 ($361,958,736)
50                              $325,338,851
51                              $252,712,101
52                              $363,258,859
53               $497,366,869 ($485,015,179)
54                              $349,822,765
55               $577,425,734 ($525,373,250)
56                              $383,257,136
57               $940,335,536 ($867,893,978)
58                              $919,838,758
59                              $532,680,671
60                              $660,940,780
61                              $798,958,162
62                              $631,744,560
63                              $886,686,817
64                            $1,066,969,703
65                              $665,692,281
66                              $877,244,782
67           $1,290,000,000 ($1,287,000,000)
68                              $657,818,612
69                            $1,159,398,397
70                            $1,028,570,889
71                            $1,034,799,409
72                            $1,242,805,359
73                              $509,526,737
Name: Worldwide gross, Length: 74, dtype: object

In [29]:
gross_list=movies_df['Worldwide gross']
gross_list[25]

'SEK1,202,319 SW (~$253,000)'

In [46]:
#movies_df.loc[df['Title']=='TBD'].index, inplace=True

total_gross=[]
rental_distribution=[] 
temp_array=[]
for g in gross_list:
    g_i=g.split()
        #print(g_i)
    n0=re.sub("\D", "",g_i[0])
    

    if len(g_i)>1:
        n1=re.sub("\D", "",g_i[1])
    else:
        n1=0
    temp_array.append(f" {n0}+{n1}")

movies_df['temp']=temp_array
inter_list=movies_df['temp'].str.split('+')[0]

inter_list = list(map(int, inter_list))
inter_list

movies_df.head()

,Year,Title,Worldwide gross,Budget,temp,Total Sales
0,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423",418200000+8500000,426700000
1,1939,Gulliver's Travels,"$3,200,000*","$700,000",3200000+0,3200000
2,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000",87000862+3500000,90500862
3,1941,Dumbo,"$1,600,000*","$950,000",1600000+0,1600000
4,1942,Bambi,"$267,447,150 ($3,449,353)R","$1,700,000–2,000,000",267447150+3449353,270896503

In [48]:
new_sum_list=[]
for t in temp_array:
    int_list=t.split('+')
    try:
        int_list = list(map(int, int_list))
        new_sum_list.append(int_list[0]+int_list[1])
        #print(f"{t}....{int_list[0]+int_list[1]}")
    except:
        #print(f"original {t}")
        new_sum_list.append(t)
movies_df['Total Sales']=new_sum_list
#movies_df.to_csv('Movies_new_again.csv')

movies_df.drop(['temp'],axis=1)
movies_df.head()

,Year,Title,Worldwide gross,Budget,temp,Total Sales
0,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423",418200000+8500000,426700000
1,1939,Gulliver's Travels,"$3,200,000*","$700,000",3200000+0,3200000
2,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000",87000862+3500000,90500862
3,1941,Dumbo,"$1,600,000*","$950,000",1600000+0,1600000
4,1942,Bambi,"$267,447,150 ($3,449,353)R","$1,700,000–2,000,000",267447150+3449353,270896503

In [49]:
movies_final1_df=pd.read_csv('Movies_Gross_Sales.csv')
movies_final1_df

,Year,Title,Worldwide gross,Budget,Total Sales
0,1937,Snow White and the Seven Dwarfs,"$418,200,000+ ($8,500,000)R","$1,488,423",426700000
1,1939,Gulliver's Travels,"$3,200,000*","$700,000",3200000
2,1940,Pinocchio,"$87,000,862* ($3,500,000)R","$2,600,000",90500862
3,1941,Dumbo,"$1,600,000*","$950,000",1600000
4,1942,Bambi,"$267,447,150 ($3,449,353)R","$1,700,000–2,000,000",270896503
5,1943,Victory Through Air Power,"$799,000*","~$789,000",799000
6,1944,The Three Caballeros,"$3,355,000R",TBD,3355000
7,1945,The Enchanted Sword,"ES€5,595,283ES (~$90,000)",TBD,5685283
8,1946,Make Mine Music,"$3,275,000R","$1,370,000",3275000
9,1947,Fun and Fancy Free,"$3,165,000R",TBD,3165000
10,1948,Melody Time,"$2,560,000R","$1,500,000",2560000
11,1949,The Adventures of Ichabod and Mr. Toad,"$1,625,000R",TBD,1625000
12,1950,Cinderella,"$263,591,415($20,000,000/$7,800,000)*R","$2,200,000",263591415
13,1951,Alice in Wonderland,"$2,400,000*","$3,000,000",2400000
14,1953,Peter Pan,"$145,000,000 ($7,000,000)","$3,000,000–4,000,000",152000000
15,1955,Lady and the Tramp,"$187,000,000 ($6,500,000)*R","$4,000,000",193500000
16,1959,Sleeping Beauty,"$51,600,000* ($5,300,000)R","$6,000,000",56900000
17,1961,One Hundred and One Dalmatians,"$215,880,212","$3,600,000–4,000,000",215880212
18,1963,The Sword in the Stone,"$22,182,353*R ($13,050,777)*R","$3,000,000",35233130
19,1964,"Hey There, It's Yogi Bear","$1,940,903*–2,438,233*($1,130,000)R",TBD,1940903
20,1966,The Man Called Flintstone,"$2,764,684*",TBD,2764684
21,1967,The Jungle Book,"$378,000,000($23,800,000)R","$3,900,000–4,000,000",378000000
22,1968,Out of an Old Man's Head,"SEK1,270,971SW (~$245,000)H",TBD,1515971
23,1969,A Boy Named Charlie Brown,"$12,000,000*","$1,100,000",12000000
24,1970,The Aristocats,"$191,000,000 ($26,462,000)R","$4,000,000",217462000
25,1971,Daisy Town,"SEK1,202,319 SW (~$253,000)",TBD,253000
26,1972,Fritz the Cat,"$90,000,000","$850,000",90000000
27,1973,Robin Hood,"$32,056,467* ($17,160,000)R","$5,000,000",49216467
28,1974,Dunderklumpen!,"SEK5,813,000SW (~$2,675,205.50)H",TBD,273333550
29,1975,The Pinchcliffe Grand Prix,"$6,439,069NW SW",TBD,6439069
...,...,...,...,...,...
44,1990,The Rescuers Down Under,"$47,431,461",TBD,47431461
45,1991,Beauty and the Beast,"$424,967,620 ($351,863,363)","$25,000,000",776830983
46,1992,Aladdin,"$504,050,219","$28,000,000",504050219
47,1993,The Nightmare Before Christmas,"$81,877,069 ($50,003,043)*","$18,000,000",131880112
48,1994,The Lion King,"$968,483,777 ($766,964,132)","$45,000,000",1735447909
49,1995,Toy Story,"$373,554,033 ($361,958,736)","$30,000,000",735512769
50,1996,The Hunchback of Notre Dame,"$325,338,851","$100,000,000",325338851
51,1997,Hercules,"$252,712,101","$85,000,000",252712101
52,1998,A Bug's Life,"$363,258,859","$120,000,000",363258859
53,1999,Toy Story 2,"$497,366,869 ($485,015,179)","$90,000,000",982382048
54,2000,Dinosaur,"$349,822,765","$127,500,000",349822765
55,2001,"Monsters, Inc.","$577,425,734 ($525,373,250)","$115,000,000",1102798984
56,2002,Ice Age,"$383,257,136","$59,000,000",383257136
57,2003,Finding Nemo,"$940,335,536 ($867,893,978)","$94,000,000",1808229514
58,2004,Shrek 2,"$919,838,758","$150,000,000",919838758
59,2005,Madagascar,"$532,680,671","$75,000,000",532680671
60,2006,Ice Age: The Meltdown,"$660,940,780","$80,000,000",660940780
61,2007,Shrek the Third,"$798,958,162","$160,000,000",798958162
62,2008,Kung Fu Panda,"$631,744,560","$130,000,000",631744560
63,2009,Ice Age: Dawn of the Dinosaurs,"$886,686,817","$90,000,000",886686817
64,2010,Toy Story 3,"$1,066,969,703","$200,000,000",1066969703
65,2011,Kung Fu Panda 2,"$665,692,281","$150,000,000",665692281
66,2012,Ice Age: Continental Drift,"$877,244,782","$95,000,000",877244782
67,2013,Frozen [nb 2],"$1,290,000,000 ($1.287×109)","$150,000,000",1291287109
68,2014,Big Hero 6,"$657,818,612","$165,000,000",657818612
69,2015,Minions,"$1,159,398,397","$74,000,000",1159398397
70,2016,Finding Dory,"$1,028,570,889","$200,000,000",1028570889
71,2017,Despicable Me 3,"$1,034,799,409","$80,000,000",1034799409
72,2018,Incredibles 2,"$1,242,805,359","$200,000,000",1242805359
73,2019,How to Train Your Dragon: The Hidden World,"$509,000,740","$129,000,000",509000740

In [102]:
#gross_list.str.find('R')

In [50]:

engine = create_engine("mysql://root:Shining$tar3@localhost/disney")
conn = engine.connect()


engine.table_names()

['dis_characters',
 'dis_voices',
 'disneygrosssales',
 'disneylist',
 'imdbdisney',
 'movie_disney_gross_sales1',
 'movie_gross_sales',
 'wikidisney']

In [52]:
movies_final1_df.to_sql(name='disneygrosssales', con=engine, if_exists='append', index=False)

254